bortsov/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sd.c
        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful)   // set bus width
            return status;

        outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR)|SD_CSR_DBW_4BIT);
    }
    else if ((pSD->uCardType == SD_TYPE_MMC) ||(pSD->uCardType == SD_TYPE_EMMC))
    {
        outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR) & ~SD_CSR_DBW_4BIT);
    }

    if ((status = SD_SDCmdAndRsp(pSD, 16, SD_BLOCK_SIZE, 0)) != Successful) // set block length
        return status;
    outpw(REG_NAND_SDBLEN, SD_BLOCK_SIZE - 1);           // set the block size

    SD_SDCommand(pSD, 7, 0);

    outpw(REG_NAND_SDIER, inpw(REG_NAND_SDIER)|SD_IER_BLKD_IE);

    return Successful;
}

/*-----------------------------------------------------------------------------
 * sdioSD_Read_in_blksize(), To read data with black size "blksize"
 *---------------------------------------------------------------------------*/
int SD_Read_in_blksize(struct FMI_SD_INFO *pSD, uint32_t uSector, uint32_t uBufcnt, uint32_t uDAddr, uint32_t blksize)
{
    char volatile bIsSendCmd=false, buf;
    unsigned int volatile reg;
    int volatile i, loop, status;

    //--- check input parameters
    if (uBufcnt == 0)
    {
        return SD_SELECT_ERROR;
    }

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->uRCA, 0)) != Successful)
        return status;
    SD_CheckRB();

    outpw(REG_NAND_SDBLEN, blksize - 1);   // the actual byte count is equal to (SDBLEN+1)

    if ((pSD->uCardType == SD_TYPE_SD_HIGH) || (pSD->uCardType == SD_TYPE_EMMC))
        outpw(REG_NAND_SDARG, uSector);
    else
        outpw(REG_NAND_SDARG, uSector * blksize);
    outpw(REG_NAND_DMACSAR, uDAddr);

    loop = uBufcnt / 255;
    for (i=0; i<loop; i++)
    {
        reg = (inpw(REG_NAND_SDCSR) & ~SD_CSR_CMD_MASK) | 0xff0000;
        if (bIsSendCmd == false)
        {
            outpw(REG_NAND_SDCSR, reg|(18<<8)|(SD_CSR_CO_EN | SD_CSR_RI_EN | SD_CSR_DI_EN));
            bIsSendCmd = true;
        }
        else
            outpw(REG_NAND_SDCSR, reg | SD_CSR_DI_EN);

        while(1) {
            if ((inpw(REG_NAND_SDISR) & SD_ISR_BLKD_IF) && (!(inpw(REG_NAND_SDCSR) & SD_CSR_DI_EN))) {
                outpw(REG_NAND_SDISR, SD_ISR_BLKD_IF);
                break;
            }

            if (pSD->bIsCardInsert == false)
                return SD_NO_SD_CARD;
        }

        if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC7_OK)) {     // check CRC7
            MSG_DEBUG("sdioSD_Read_in_blksize(): response error!\n");
            return SD_CRC7_ERROR;
        }

        if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC16_OK)) {    // check CRC16
            MSG_DEBUG("sdioSD_Read_in_blksize() :read data error!\n");
            return SD_CRC16_ERROR;
        }
    }

    loop = uBufcnt % 255;
    if (loop != 0)
    {
        reg = inpw(REG_NAND_SDCSR) & (~SD_CSR_CMD_MASK);
        reg = reg & (~SD_CSR_BLK_CNT_MASK);
        reg |= (loop << 16);    // setup SDCR_BLKCNT

        if (bIsSendCmd == false)
        {
            outpw(REG_NAND_SDCSR, reg|(18<<8)|(SD_CSR_CO_EN | SD_CSR_RI_EN | SD_CSR_DI_EN));
            bIsSendCmd = true;
        }
        else
            outpw(REG_NAND_SDCSR, reg | SD_CSR_DI_EN);

        while(1) {
            if ((inpw(REG_NAND_SDISR) & SD_ISR_BLKD_IF) && (!(inpw(REG_NAND_SDCSR) & SD_CSR_DI_EN))) {
                outpw(REG_NAND_SDISR, SD_ISR_BLKD_IF);
                break;
            }
            if (pSD->bIsCardInsert == false)
                return SD_NO_SD_CARD;
        }

        if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC7_OK)) {     // check CRC7
            MSG_DEBUG("sdioSD_Read_in_blksize(): response error!\n");
            return SD_CRC7_ERROR;
        }

        if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC16_OK)) {    // check CRC16
            MSG_DEBUG("sdioSD_Read_in_blksize(): read data error!\n");
            return SD_CRC16_ERROR;
        }
    }

    if (SD_SDCmdAndRsp(pSD, 12, 0, 0)) {    // stop command
        MSG_DEBUG("stop command fail !!\n");
        return SD_CRC7_ERROR;
    }
    SD_CheckRB();

    SD_SDCommand(pSD, 7, 0);

    return Successful;
}

/*-----------------------------------------------------------------------------
 * sdioSD_Read_in(), To read data with default black size SD_BLOCK_SIZE
 *---------------------------------------------------------------------------*/
int SD_Read_in(struct FMI_SD_INFO *pSD, uint32_t uSector, uint32_t uBufcnt, uint32_t uDAddr)
{
    return SD_Read_in_blksize(pSD, uSector, uBufcnt, uDAddr, SD_BLOCK_SIZE);
}

/*-----------------------------------------------------------------------------
 * sdioSD_Write_in(), To write data with static black size SD_BLOCK_SIZE
 *---------------------------------------------------------------------------*/
int SD_Write_in(struct FMI_SD_INFO *pSD, uint32_t uSector, uint32_t uBufcnt, uint32_t uSAddr)
{
    char volatile bIsSendCmd = false;
    unsigned int volatile reg;
    int volatile i, loop, status;

    //--- check input parameters
    if (uBufcnt == 0)
    {
        return SD_SELECT_ERROR;
    }

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->uRCA, 0)) != Successful)
        return status;

    SD_CheckRB();

    // According to SD Spec v2.0, the write CMD block size MUST be 512, and the start address MUST be 512*n.
    outpw(REG_NAND_SDBLEN, SD_BLOCK_SIZE - 1);           // set the block size

    if ((pSD->uCardType == SD_TYPE_SD_HIGH) || (pSD->uCardType == SD_TYPE_EMMC))
        outpw(REG_NAND_SDARG, uSector);
    else
        outpw(REG_NAND_SDARG, uSector * SD_BLOCK_SIZE);  // set start address for SD CMD

    //for(i=0; i<2000; i++);
    outpw(REG_NAND_DMACSAR, uSAddr);
    loop = uBufcnt / 255;
    for (i=0; i<loop; i++)
    {
        reg = (inpw(REG_NAND_SDCSR) & 0xff00c080)|0xff0000;
        if (!bIsSendCmd)
        {
            outpw(REG_NAND_SDCSR, reg|(25<<8)|(SD_CSR_CO_EN | SD_CSR_RI_EN | SD_CSR_DO_EN));
            bIsSendCmd = true;
        }
        else
            outpw(REG_NAND_SDCSR, reg | SD_CSR_DO_EN);

        while(1) {
            if ((inpw(REG_NAND_SDISR) & SD_ISR_BLKD_IF) && (!(inpw(REG_NAND_SDCSR) & SD_CSR_DO_EN))) {
                outpw(REG_NAND_SDISR, SD_ISR_BLKD_IF);
                break;
            }
            if (pSD->bIsCardInsert == false)
                return SD_NO_SD_CARD;
        }

        if ((inpw(REG_NAND_SDISR) & SD_ISR_CRC_IF) != 0) {      // check CRC
            outpw(REG_NAND_SDISR, SD_ISR_CRC_IF);
            return SD_CRC_ERROR;
        }
    }
    //for(i=0; i<2000; i++);
    loop = uBufcnt % 255;
    if (loop != 0)
    {
        reg = (inpw(REG_NAND_SDCSR) & 0xff00c080) | (loop << 16);
        if (!bIsSendCmd)
        {
            outpw(REG_NAND_SDCSR, reg|(25<<8)|(SD_CSR_CO_EN | SD_CSR_RI_EN | SD_CSR_DO_EN));
            bIsSendCmd = true;
        }
        else
            outpw(REG_NAND_SDCSR, reg | SD_CSR_DO_EN);

        while(1) {
            if ((inpw(REG_NAND_SDISR) & SD_ISR_BLKD_IF) && (!(inpw(REG_NAND_SDCSR) & SD_CSR_DO_EN))) {
                outpw(REG_NAND_SDISR, SD_ISR_BLKD_IF);
                break;
            }
            if (pSD->bIsCardInsert == false)
                return SD_NO_SD_CARD;
        }

        if ((inpw(REG_NAND_SDISR) & SD_ISR_CRC_IF) != 0) {      // check CRC
            outpw(REG_NAND_SDISR, SD_ISR_CRC_IF);
            return SD_CRC_ERROR;
        }
    }
    outpw(REG_NAND_SDISR, SD_ISR_CRC_IF);
    //for(i=0; i<2000; i++);
    if (SD_SDCmdAndRsp(pSD, 12, 0, 0))      // stop command
    {
        return SD_CRC7_ERROR;
    }
    SD_CheckRB();

    //for(i=0; i<2000; i++);
    SD_SDCommand(pSD, 7, 0);

    return Successful;
}


void SD_Get_SD_info(struct FMI_SD_INFO *pSD, struct DISK_DATA *_info)
{
    unsigned int i;
    unsigned int R_LEN, C_Size, MULT, size;
    unsigned int Buffer[4];
    unsigned char *ptr;

    SD_SDCmdAndRsp2(pSD, 9, pSD->uRCA, Buffer);

    if ((pSD->uCardType == SD_TYPE_MMC) || (pSD->uCardType == SD_TYPE_EMMC))
    {
        /* for MMC/eMMC card */
        if ((Buffer[0] & 0xc0000000) == 0xc0000000)
        {
            /* CSD_STRUCTURE [127:126] is 3 */
            /* CSD version depend on EXT_CSD register in eMMC v4.4 for card size > 2GB */
            SD_SDCmdAndRsp(pSD, 7ul, pSD->uRCA, 0ul);

