bortsov/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sd.c
            ptr = (unsigned char *)((unsigned int)_sd_ucSDHCBuffer);
            outpw(REG_NAND_DMACSAR, (unsigned int)ptr); // set DMA transfer starting address
            outpw(REG_NAND_SDBLEN, 511); // read 512 bytes for EXT_CSD

            if (SD_SDCmdAndRspDataIn(pSD, 8ul, 0x00ul) == Successful)
            {
                SD_SDCommand(pSD, 7ul, 0ul);
                outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR) | SD_CSR_CLK8_OE);
                while ( (inpw(REG_NAND_SDCSR) & SD_CSR_CLK8_OE) == SD_CSR_CLK8_OE)
                {
                }

                _info->totalSectorN = (*(unsigned int *)(ptr + 212));
                _info->diskSize = _info->totalSectorN / 2ul;
            }
        }
        else
        {
            /* CSD version v1.0/1.1/1.2 in eMMC v4.4 spec for card size <= 2GB */
            R_LEN = (Buffer[1] & 0x000f0000ul) >> 16;
            C_Size = ((Buffer[1] & 0x000003fful) << 2) | ((Buffer[2] & 0xc0000000ul) >> 30);
            MULT = (Buffer[2] & 0x00038000ul) >> 15;
            size = (C_Size+1ul) * (1ul<<(MULT+2ul)) * (1ul<<R_LEN);

            _info->diskSize = size / 1024ul;
            _info->totalSectorN = size / 512ul;
        }
    }
    else
    {
        if ((Buffer[0] & 0xc0000000) != 0x0ul)
        {
            C_Size = ((Buffer[1] & 0x0000003ful) << 16) | ((Buffer[2] & 0xffff0000ul) >> 16);
            size = (C_Size+1ul) * 512ul; /* Kbytes */

            _info->diskSize = size;
            _info->totalSectorN = size << 1;
        }
        else
        {
            R_LEN = (Buffer[1] & 0x000f0000ul) >> 16;
            C_Size = ((Buffer[1] & 0x000003fful) << 2) | ((Buffer[2] & 0xc0000000ul) >> 30);
            MULT = (Buffer[2] & 0x00038000ul) >> 15;
            size = (C_Size+1ul) * (1ul<<(MULT+2ul)) * (1ul<<R_LEN);

            _info->diskSize = size / 1024ul;
            _info->totalSectorN = size / 512ul;
        }
    }
    _info->sectorSize = 512;

    SD_SDCmdAndRsp2(pSD, 10, pSD->uRCA, Buffer);

    _info->vendor[0] = (Buffer[0] & 0xff000000) >> 24;
    ptr = (unsigned char *)Buffer;
    ptr = ptr + 4;
    for (i=0; i<5; i++)
        _info->product[i] = *ptr++;
    ptr = ptr + 10;
    for (i=0; i<4; i++)
        _info->serial[i] = *ptr++;

    MSG_DEBUG("The size is %d KB\n", _info->diskSize);
    MSG_DEBUG("            %d bytes * %d sectors\n", _info->sectorSize, _info->totalSectorN);
}

void SD_SetReferenceClock(uint32_t uClock)
{
    _sd_ReferenceClock = uClock;    // kHz
}


int SD_ChipErase(struct FMI_SD_INFO *pSD, struct DISK_DATA *_info)
{
    int status=0;

    status = SD_SDCmdAndRsp(pSD, 32, 512, 6000);
    if (status < 0)
    {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 33, _info->totalSectorN*512, 6000);
    if (status < 0)
    {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 38, 0, 6000);
    if (status < 0)
    {
        return status;
    }
    SD_CheckRB();

    return 0;
}

